Show / Hide Table of Contents
Class LoadingSLS
Loading SLS
Inheritance
System.Object
LoadingSLS
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.Load
Assembly: IdeaRS.OpenModel.dll
Syntax
public class LoadingSLS
Constructors
Improve this Doc   View Source
LoadingSLS()
Constructor
Declaration
public LoadingSLS()
Properties
Improve this Doc   View Source
InternalForces
Internal force in section (permanent for staged section)
Declaration
public ResultOfInternalForces InternalForces { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
InternalForcesImperfection
Internal forces of imperfection effect
Declaration
public ResultOfInternalForces InternalForcesImperfection { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
InternalForcesVariable
Variable internal force in staged section only
Declaration
public ResultOfInternalForces InternalForcesVariable { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
 Improve this Doc
 View Source